""" 
 Задайте список из n чисел последовательности (1 + 1/n)**n, выведеите его на экран, а так же сумму элементов списка. 
"""
n=int(input('Введите число: '))
sum=0
a=[]
for i in range(1,n+1):
    a.append(round((1 + 1/i)**i,2))
    sum+=a[i-1]

print(a)
print('Сумма элементов' ,sum)
